Revit 2027 API
CustomFieldData.GetCustomFieldProperties Method
 Gets an instance of ICustomFieldProperties which represents the properties of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICustomFieldProperties GetCustomFieldProperties()
Public Function GetCustomFieldProperties As ICustomFieldProperties
public:
ICustomFieldProperties^ GetCustomFieldProperties()
member GetCustomFieldProperties : unit -> ICustomFieldProperties
Return Value
ICustomFieldProperties
 Returns an instance of ICustomFieldProperties.
Exceptions
Exception | Condition
InvalidOperationException |  Can't obtain the properties from a CustomFieldData of a SchedulableField (which is not added to a schedule).
See Also
Reference
CustomFieldData Class
Autodesk.Revit.DB Namespace